<script>
import { computed } from 'vue'
export default {
    name: "InfoBox",
    props: {
        type: String,
        title: String
    },
    setup(props) {
        const boxClass = computed(() => {
            const typeList = ['tip', 'warning', 'danger']
            return typeList.includes(props.type) ? props.type : 'tip'
        })
        const boxTitle = title => {
            const titleMap = {
                tip: '提示',
                warning: '注意',
                danger: '警告'
            }
            return props.title ? props.title : titleMap[title]
        }
        const setIcon = type => {
            return `/images/icons/${type}.png`
        }
        return {
            boxClass,
            boxTitle,
            setIcon
        }
    }
}
</script>
<template>
    <div class="info-box custom-container" :class="boxClass">
        <p class="info-title">
            <svg v-if="boxClass == 'tip'" t="1682493219380" class="info-icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="1065" width="32" height="32" xmlns:xlink="http://www.w3.org/1999/xlink"><path d="M512 958.016C266.08 958.016 65.984 757.952 65.984 512 65.984 266.08 266.08 65.984 512 65.984c245.952 0 446.016 200.064 446.016 446.016C958.016 757.952 757.952 958.016 512 958.016zM512 129.984C301.344 129.984 129.984 301.344 129.984 512c0 210.624 171.36 382.016 382.016 382.016 210.624 0 382.016-171.36 382.016-382.016C894.016 301.344 722.624 129.984 512 129.984zM512 304m-48 0a1.5 1.5 0 1 0 96 0 1.5 1.5 0 1 0-96 0ZM512 768c-17.664 0-32-14.304-32-32l0-288c0-17.664 14.336-32 32-32s32 14.336 32 32l0 288C544 753.696 529.664 768 512 768z" fill="#409eff" p-id="1066"></path></svg>
            <svg v-if="boxClass == 'warning'" t="1682493255370" class="info-icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="1556" width="32" height="32" xmlns:xlink="http://www.w3.org/1999/xlink"><path d="M873.439 960.4 152.591 960.4c-48.34 0-87.174-19.097-106.568-52.405-19.399-33.308-17.039-76.816 6.499-119.331L416.23 131.772C439.905 88.947 475.11 64.4 512.775 64.4c37.67 0 72.84 24.517 96.581 67.304l364.09 657.027c23.532 42.516 25.966 85.992 6.531 119.296C960.614 941.334 921.748 960.4 873.439 960.4L873.439 960.4zM512.812 133.356c-11.976 0-25.693 11.964-36.813 31.998L112.291 822.313c-11.396 20.618-14.063 39.138-7.256 50.821 6.813 11.654 24.155 18.347 47.557 18.347l720.848 0c23.439 0 40.75-6.656 47.558-18.347 6.771-11.653 4.14-30.166-7.287-50.785L549.626 165.354C538.538 145.32 524.751 133.356 512.812 133.356L512.812 133.356zM513.017 649.334c-18.883 0-34.21-15.414-34.21-34.479L478.807 304.545c0-19.033 15.327-34.48 34.21-34.48 18.886 0 34.213 15.447 34.213 34.48l0 310.309C547.229 633.92 531.902 649.334 513.017 649.334zM512.771 817.871c29.441 0 53.309-24.096 53.309-53.819s-23.867-53.819-53.309-53.819-53.308 24.096-53.308 53.819S483.33 817.871 512.771 817.871z" fill="#ffc310" p-id="1557"></path></svg>
            <svg v-if="boxClass == 'danger'" t="1682493268232" class="info-icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="1855" width="32" height="32" xmlns:xlink="http://www.w3.org/1999/xlink"><path d="M635.733333 970.666667H388.266667a176.341333 176.341333 0 0 1-113.066667-46.933334l-174.933333-174.933333a178.218667 178.218667 0 0 1-46.933334-113.066667V388.266667a176.341333 176.341333 0 0 1 46.933334-113.066667l174.933333-174.933333a178.218667 178.218667 0 0 1 113.066667-46.933334h247.466666a176.341333 176.341333 0 0 1 113.066667 46.933334l174.933333 174.933333a178.218667 178.218667 0 0 1 46.933334 113.066667v247.466666a176.341333 176.341333 0 0 1-46.933334 113.066667l-174.933333 174.933333a178.218667 178.218667 0 0 1-113.066667 46.933334z m-247.466666-853.333334a113.536 113.536 0 0 0-67.797334 28.16l-174.933333 174.933334A117.973333 117.973333 0 0 0 117.333333 388.266667v247.466666a113.536 113.536 0 0 0 28.16 67.797334l174.933334 174.933333a117.973333 117.973333 0 0 0 67.84 28.202667h247.466666a113.536 113.536 0 0 0 67.797334-28.16l174.933333-174.933334a118.186667 118.186667 0 0 0 28.202667-67.84V388.266667a113.536 113.536 0 0 0-28.16-67.797334l-174.933334-174.933333a118.186667 118.186667 0 0 0-67.84-28.202667z" fill="#f11e37" p-id="1856"></path><path d="M340.053333 683.904a32.170667 32.170667 0 0 1 0-45.226667l298.666667-298.666666a32 32 0 0 1 45.226667 45.226666l-298.666667 298.666667a31.914667 31.914667 0 0 1-45.226667 0z" fill="#f11e37" p-id="1857"></path><path d="M638.72 683.904l-298.666667-298.666667A32 32 0 0 1 385.237333 340.053333l298.666667 298.666667a32.170667 32.170667 0 0 1 0 45.226667 31.914667 31.914667 0 0 1-45.226667 0z" fill="#f11e37" p-id="1858"></path></svg>
            <span>{{ boxTitle(boxClass) }}</span>
        </p>
        <p class="info-content">
            <slot>
                内容区域
            </slot>
        </p>
    </div>
</template>
<style lang="scss" scoped>
.info-box {
    padding: 0.1rem 1.5rem;
    margin: 1rem 0;
    border: 1px solid #ddd;
    border-radius: .75rem;

    .info-title {
        display: flex;

        svg.info-icon{
            width: 1.5rem;
        }

        span {
            padding-left: .5rem;
        }
    }
}

.info-box.tip {
    border-color: #409eff;
    background-color: rgba(64, 158, 255, 0.1);
    box-shadow: 0px 0px 8px 0px rgba(64, 158, 255, 0.3);

    .info-content {
        border-top: 1px dashed #409eff;
    }
}

.info-box.warning {
    border-color: #f1b300;
    background-color: rgba(241, 179, 0, 0.1);
    box-shadow: 0px 0px 8px 0px rgba(241, 179, 0, 0.3);
    color: #746000;
    .info-content {
        border-top: 1px dashed #f1b300;
    }
}

.info-box.danger {
    border-color: #f11e37;
    background-color: rgba(241, 30, 55, 0.1);
    box-shadow: 0px 0px 8px 0px rgba(241, 30, 55, 0.3);

    .info-content {
        border-top: 1px dashed #f11e37;
    }
}
</style>